;
;  Few rules for translator:
;  For beginning of translate - copy english.ini into the yourlanguage.ini
;  Please, translate text only after simbol ' = '
;
;
; TranslationAuthor: Kalju Tetlov
; TranslationAuthorEmail: kaljupost@yahoo.com
; Soft Version: 7.82
;
[GUI]
ButtonYes=Jah
ButtonNo=Ei
ButtonOK=Ok
ButtonMinimize=Minimeeri
ButtonMaximize=Maksimeeri
ButtonClose=Sule
ButtonRestore=Taasta
ButtonMenu=Menüü

[Translation]
LangCode=0425
ReadHabit=Left-to-right
LanguageName=ET
DefaultFont=Tahoma
DefaultFontSize=8
DefaultCharset=ANSI_CHARSET
;
; Message box
;
Information=Informatsioon
Warning=Hoiatus
Error=Viga
Confirm=Kinnitus
;
; Main GUI
;
FrmWRC.btnregclean.caption=Registripuhastus
FrmWRC.btnadv.caption=Süsteemi häälestus
FrmWRC.btnsilm.caption=Defragmendi registrit
FrmWRC.btnrestore.caption=Taasta
FrmWRC.btnsettings.caption=Seaded
FrmWRC.btnlikeit.caption=Hinda seda
FrmWRC.btnsuggest.caption=Ettepanekud ja tagasiside
FrmWRC.WiseSimpleButton1.caption=Koopia
;
; Reg Cleaner
;
FrmRegClean.btnall.caption=Vali kõik
FrmRegClean.btnre.caption=Soovitatud
FrmRegClean.btnnone.caption=Ei vali midagi
FrmRegClean.btnCustom.caption=Tee valikud
FrmRegClean.WiseLabel1.caption=Ajastused
FrmRegClean.lbltype.caption=Vali töösagedus:
FrmRegClean.lblweek.caption=Vali päev:
FrmRegClean.lbltime.caption=aeg:
FrmRegClean.btnScan.caption=Skaneeri
FrmRegClean.btncancel.caption=Katkesta
FrmRegClean.btnrescan.caption=Otsi uuesti
FrmRegClean.lblstat.caption=Kui Te pole kaua oma arvuti registrit puhastanud, soovitame kohe puhastada!
FrmRegClean.vtrc.Columns[0]=Kuupäev
FrmRegClean.vtrc.Columns[1]=Registrivõti
;
; Optimizer
;
FrmOptimizer.btnSlimming.caption=Optimeeri
FrmOptimizer.btnnone.caption=Ei vali midagi
FrmOptimizer.btnall.caption=Vali kõik
FrmOptimizer.btnDefault.caption=Süsteem vaikimisi
FrmOptimizer.lblrecommendinfo.caption=Palun vaata kõiki meie tooteid lehelt wisecleaner.com !
FrmOptimizer.lblpce.caption=Wise PC Engineer
FrmOptimizer.lblpceinfo.caption=Wise PC Engineer (tark arvutiinsener) koosneb registri, ketta ja teistest süsteemi hooldusvahenditest. Efektiivne ja lihtne!
FrmOptimizer.lblwdcinfo.caption=Wise Disk Cleaner(tark kettapuhastaja) on parim vaba kettapuhastaja, puhastab rämsfailid ja isiklikuandmed . Kiire, põhjalik ja turvaline!
FrmOptimizer.lblwdc.caption=Wise Disk Cleaner
FrmOptimizer.lblre.caption=Soovite parandada oma Windows'i jõudlust?
Frmoptimizer.lblinfoex.caption=Süsteemihäälestaja abil saate kiirendada võrguühendust, arvuti tööd ja stabiliseerida süsteemi.
FrmOptimizer.btnoptimize.caption=Optimeeri
;
; Reg Defrag
;
FrmRegDefragger.lblinfo.caption=Registri deframentimine tagab arvuti kiirema ja stabiilsema töö.
FrmRegDefragger.lblstat.caption=Kui Sa pole oma arvuti registrit kaua defragmentinud, soovitame seda kindlasti kohe teha!
FrmRegDefragger.btndefrag.caption=Defragmendi
FrmRegDefragger.lblinfo1.caption=1. Soovitame kindlasti kõik teised rakendused enne alustamist sulgeda/lõpetada ja salvestada pooleliolevad tööd.
FrmRegDefragger.lblinfo2.caption=2. Analüüsimise ajal Sinu süsteem ei vasta.
FrmRegDefragger.lblinfo3.caption=3. NB! Sinu arvutile tehakse automaatselt taaskäivitus peale defragmentimist.
FrmRegDefragger.lblinfo4.caption=4. Palun ära peata defragmentimist, vastasel juhul võivad tekkida ettearvamatud probleemid.
FrmRegDefragger.vtdefrag.Columns[0]=Kogumi nimi
FrmRegDefragger.vtdefrag.Columns[1]=Algsuurus
FrmRegDefragger.vtdefrag.Columns[2]=Uus suurus
FrmRegDefragger.vtdefrag.Columns[3]=Hinnaguline vähenemine
FrmRegDefragger.btnAnalysis.caption=Analüüsi
;
; Custom scan areas
;
Frmcustom.caption=Tee valikud
Frmcustom.btnre.caption=Soovitatud
Frmcustom.btnall.caption=Vali kõik
Frmcustom.btnnone.caption=Ei vali midagi
Frmcustom.btncancel.caption=Katkesta
Frmcustom.btnok.caption=Ok
;
; About Window
;
FrmAbout.lblver.caption=Praegune version:
FrmAbout.lblemail.caption=Tugiteenuse email:
FrmAbout.lblemailinfo.caption=support@wisecleaner.com
FrmAbout.lblhome.caption=Koduleht:
FrmAbout.lblhomeinfo.caption=http://www.wisecleaner.com
FrmAbout.lblthanks.caption=Täname järgmisi inimesi kaastöö eest:
FrmAboutWin.caption=Teave
FrmAboutWin.btnok.caption=Ok
;
; Settings
;
FrmSettings.caption=Seaded
FrmSettings.tsCommon.caption=Peamised
FrmGeneral.chkexp.caption=Ühine Customer Experience Improvement Program'miga
FrmGeneral.lblexp.caption=Detailid
FrmSettings.tsAutoRun.caption=Automaatne
FrmSettings.tsExclusion.caption=Välistatud
FrmSettings.btnrestore.caption=Meist
FrmSettings.btnok.caption=Ok
FrmSettings.btncancel.caption=Katkesta
;
; Auto Run
;
FrmAutorunSettings.chk1.caption=Tee töölauale ikoon "Puhasta 1-klikiga"
FrmAutorunSettings.lblcmd.caption=Käsuliini meetod
FrmAutorunSettings.lblcmdinfo.caption=Kasutades käsuliine, saad oma arvutit puhastada ka automaatselt. Rohkem infot, vajuta F1 või klikka allpool olevale kirjele "Online abi" .
FrmAutorunSettings.btnhelp.caption=Online abi
;
; Exclusion List
;
FrmExclusion.btnAdd.caption=Lisa võtmesõna
FrmExclusion.btnExport.caption=Ekspordi
FrmExclusion.btnRemove.caption=Eemalda
FrmExclusion.btnimport.caption=Impordi
Frminput.btnok.caption=OK
Frminput.btncancel.caption=Katkesta
;
; General Settings
;
FrmGeneral.chkNews.caption=Telli automaatsed uudiskirjad
FrmGeneral.chkbackup.caption=Tee koopia enne puhastamist
FrmGeneral.WiseLabel1.caption=Otsi uuendusi:
FrmGeneral.WiseLabel2.caption=Keelevalik:
FrmGeneral.btnchecknew.caption=Otsi kohe
FrmGeneral.lbtran.caption=Tõlgi oma keelde...
FrmGeneral.lblscanmode.caption=Kuidas registrit skaneerida
FrmGeneral.rdnormal.caption=normaalselt (soovitatav)
FrmGeneral.rdssafe.caption=ainult turvalised (näitab "turvaline kustutada"  üksusi)
FrmGeneral.rddeep.caption=põhjalik otsimine ( ainult kogenud kasutajale)
;
; Backup and Restore
;
Frm_br.btncancel.caption=Katkesta
FrmBackup.caption=Taastamine
FrmBackup.btnreg.caption=Tee registrist täiskoopia
FrmBackup.btnsys.caption=Tee süsteemi taastepunkt
FrmRestore.caption=Taastamiskeskus
FrmRestore.btnRegBk.caption=Register
FrmRestore.btnSysBK.caption=Süsteem
FrmRestore.btnclose.caption=Sule
FrmRestore.btnrestore.caption=Taasta
FrmRestore.btnremove.caption=Kustuta
;
; Update
;
frmupdate.caption=Tarkvara uuendused
;
; Popup Menus
;
pmHelp=Online abi
pmforum=Foorum
pmHome=Koduleht
pmContact=Võta ühendust
pmCheckNew=Otsi uuendusi
pmLang=Muuda keelt
pmSkin=Vali välimus
pmAbout=Teave
pmIgnore=Ignoreeri seda
pmrec=Vali ainult turvalised
pmAll1=Vali kõik
pmNone=Ei vali midagi
pmGo=Ava registriparandaja...
pmExport=Ekspordi...
pmPortable=Tee portatiivne versioon
;
; Like Us
;
FrmlikeUs.lblTitle.caption=Kui Sulle meeldib Wise Registry Cleaner, palun lisa see oma armastatud tasuta tööristade hulka.
FrmlikeUs.lblInfo.caption=Palun jaga Wise Registry Cleaner'it oma perekonnale, sõpradele, klassikaaslastele, kolleegidele,..e-maili, blogi, twitteri, youtube, facebook'i, jne kaudu. See on suurepärane  heategu!  Nii tood nende ellu efektiivsuse ja lihtsuse.
FrmlikeUs.lblRate.caption=Hinda programmi:
FrmlikeUs.lblfollow.caption=Jälgi meid:
FrmlikeUs.lblshare.caption=Jaga programmi:
FrmlikeUs.btndownload.caption=Tasuta laadimine
FrmlikeUs.imgrate.hint=Lisa oma  5 tärni
FrmlikeUs.imgmail.hint=Jaga sõpradele
FrmlikeUs.imgface1.hint=Jaga facebook'is
FrmlikeUs.imgface2.hint=Jälgi meid facebook'is
FrmlikeUs.imgtwitter1.hint=Jaga twitteris
FrmlikeUs.imgtwitter2.hint=Jälgi meid twitteris
FrmlikeUs.Caption=Hinda programmi
FrmlikeUs.lbldownload.caption=Lae rohkem vaba tarkvara: WiseCleaner.com

;
; DefProcess
;
FrmProcess.Caption=Registri analüüsimine
FrmProcess.lblwait.caption=Analüüsin...
FrmProcess.lblinfo.caption=Sinu arvuti ei reageeri mõne minuti jooksul.
FrmProcess.lblwait.caption=Analüüsin, palun oota...

[Message]
Total=Kokku
DefragRate=Sa saad vähendada registri mahtu  %s.
SuggestDefrag=Soovitame registrit kohe defragmentida.
SuggestIgnore=Register ei vaja momendil defragmentimist, palun kontrolli varsti uuesti.
TypeNoError=puhas
NeverClean=Kui Sa pole kaua registrit puhastanud, on soovitatav seda kohe teha!
AdviseClean=Regulaarne registripuhastus tagab arvuti kiire, turvalise ja stabiilse töö.
DupItem=See on juba nimekirjas.
Advisedefrag=Registri defragmeerimine tagab arvutile kiire ja stabiilse töötamise.
NeverDefrag=Sa pole registrit veel defragmeerinud?  Soovitame seda kohe teha!
LastDefrag=Viimati defragmentisid Sa registrit :
TotalDefrag= %.2f  pakiti kokku.
DefaultValue=(Vaikimisi)
RegBackup=Tee registri koopia
RegRestore=Taasta register
CreateBackup=Kogun koopiaks andmeid...
Compress=Pakin kokku...
Extracte=Pakin lahti...
Complete=Valmis
RestoreReg=Taastan registrit...Oota mõni minut...
NotSupportOS=Seda toimingut ei saa selles op-süsteemis teha.
EnableRestore=Süsteemitaaste on keelatud. Soovid selle nüüd lubada?
SysCreating=Teen taastepunkti...
SysRestoring=Valmistun süsteemi taastama...
RestorePointDone=Taastepunkt on nüüd edukalt tehtud.
RestorePointFail=Taastepunkti tegemine ei õnnestunud.
ErrorMsg=Veateade:
Area=Ala
Summary=Selgitus
LeastOne=Palun vali puhastamiseks vähemalt üks ala.
IsRunning=Programm töötab, palun oota lõpuni ja proovi siis uuesti.
Optimized=Optimeeritud
DefragReport=Register on kokku pakitud. Siin on raport:
DefragReport1=Registri vana suurus:
DefragReport2=Registri uus suurus:
DefragReport3=Optimeeritud suurus:
ReOptimize=Optimeeri uuesti
ComfirmDefrag=Palun salvesta nüüd kõik oma pooleliolevad tööd, sest peale registri defragmeerimist teeb arvuti automaatse taaskäivituse. Soovid defragmentimisega kohe alustada?
def15After=%d päeva on möödunud ajast, kui Sa viimati registrit defragmentisid. Palun defragmendi nüüd uuesti!
def15Before=Sinu arvuti töötab seda kiiremini ja stabiilsemalt, mida puhtam ja kompaktsem on register.
KeyWord=Palun sisesta võtmesõna(d):
ExImport=Erandite nimekiri salvestati:
NoNewVer=Sinu praegune versioon ongi kõige uuem.
Daily=kord päevas
Weekly=kord nädalas
Monthly=kord kuus
Never=mitte kunagi
TranslateTo=Tõlgi oma keelde...
NeedBack=Tundub, et see on esimene kord seda programmi kasutada. Tee kindlasti registrist varukoopia. Soovid seda kohe automaatselt teha?
Newsletter=Uudiskirjad
UpgradeInfo=Uuendamise informatsioon
CannotCrTask=Ei saa ajastatud tööd määrata.
ScheduleNextTime=Järgmine kord:
Exported=Need üksused salvestati  %s. Soovid selle faili nüüd avada?
Idle=puhkeajal
Login=sisselogimisel
LastClean=Viimati puhastasid Sa registrit:
Monday=esmaspäeval
Tuesday=teisipäeval
Wednesday=kolmapäeval
Thursday=neljapäeval
Friday=reedel
Saturday=laupäeval
Sunday=pühapäeval
IssueFound=Leiti %d üksust.
Scanning=Skaneerimine
ScanCanceled=Otsimine katkes!
FindError=Kokku leiti selle kontrolliga  %d viga. Neist  %d pole turvalised parandada.
LogAll=Leiti %d üksust, neist %d korrastati.
LogFail=%d viga ei saa kõrvaldada.
StartClean=Paranda
StartScan=Skaneeri
7After=%d päeva on möödunud viimasest registripuhastusest. Soovitame seda kohe teha.
7Before=Mida puhtamaks register saab, seda kiirem ja stabiilsem Su arvuti on!
ReScanHint=Leiti %d üksust. Soovitame otsimist korrata, et leida veel probleeme.
CleanNow=Palun klikka  "Puhasta" probleemide koheseks parandamiseks.
NoError=Õnnitleme! Sul on puhas register!
GoodHabit=Arvuti hea jõudluse hoimiseks on kasulik regulaarselt registrit puhastada!
ReScanHint1=Soovitame potetntsiaalsete vigade avastamiseks otsimist korrata.
TypeChanged=Sa muutsid otsimise reegleid!
ReScanHint2=Palun korda otsimist.
CleanDone=Puhastamine on lõppenud!
bkAuto=automaatselt
bkManual=käsitsi
BackupDate=Tehtud
BackupType=Tüüp
Problems=Sisu
CreateDate=Kuupäev
Description=Selgitus
Removebackup=Kas soovid selle faili kustutada?
RemoveSysRestore=Kas soovid valitud taastepunkti kustutada?
NoBackupSelected=Pead valima vähemalt ühe taastefaili.
RestoreComplete=Taasta täielikult
RestoreFromSysRestore=Süsteemi taastamine nõub taaskäivitamist. Kas soovid taastamisega kohe alustada?
WhenIdle=Jõudeolekus
WhenLogin=sisselogimisel
NewVer=Uus versioon on saadaval. Kas uuendada kohe?
TranslateTo=Tõlgi....


[Tuneup]
OptIEConnection=Suurenenda max ühenduste arvu serveri kohta. Veebilehtede ja videode vaadamise kiiruse suurendamiseks.
IconCache=Suurendada süsteemi ikoonide vahemälu et kiirendada töölaua kuvamist.
RestoreAll=Kas soovid kõik Windows'i algseaded taastada?
NoSelectedItem=Pead optimeerimiseks vähemalt ühe üksuse valima.
OptItems=Järgmised  %d üksust vajavad optimeerimist.
ItemsOptimized=%d üksust optimeeriti.
TakeEff=Mõned muutused jõustuvad peale taaskäivitamist.
NoItems=Õnnitleme! Kõik üksused on optimeeritud.
BootSpeedup=Käivitus/väljalülitus kiiremaks
SystemStable=Süsteem stabiilsemaks
SystemSpeedup=Süsteem kiiremaks
NetworkSpeedup=Internet kiiremaks
PrefetchParameters=Optimeeri eelhanke faile ja parameetreid Windows'i kiiremaks käivitumiseks
BootDelay=Vähendab "otsi kettalt" aega Windows'i käivitumisel
BootPartition=Luba optimeerimist Windowsi kiiremaks käivitumiseks.
ClearPagingFile=Keela "Windows Paging File'i" kustutamine väljalülitamise kiirendamiseks
TimeOut=Vähenda rakenduste sulgemise ooteaega arvuti sulgemisel
AutoKill=Sule nö külmunud protsessid arvuti kokkujoksu vältimiseks
RestartExplorer=Taaskäivita Windows Explorer automaatselt töölaua  kadumise vältimiseks
TwoProcess=Pane Windows Explorer'i osad tööle eraldi protsessidena, et vältida konflikte
ErrorReport=Keela jõudluse suurendamiseks tõrketeavitused ekraanil
Debugger=Keela vigade parandamise kiirendamiseks silumine ( debugger )
OptMemory=Optimeeri mälu algseadeid jõudluse suurendamiseks
OptVEff=Optimeeri kirjeid ja nende osi (dialoogiboksid, menüüd, jne.)
OptFileSystem=Optimize the file system to improve system performance
OptDiskSystem=Optimeeri ketta I/O alamsüsteem jõudluse parandamiseks
DisAutoRun=Keela "Autoplay" viiruste leviku/paljunemise takistamiseks
OptDiskIdle=Optimeeri ketta I/O kui protsessor on vähe koormatud/puhkeseisus
OptTTL=Optimeeri TTL(Time To Live - eluiga) seadeid võrguühenduse parandamiseks
OptNetForward=Optimeeri võrgu ülekandevõimet kiiruse suurendamiseks
OptMTU=Paranda TCP/IP tulemuslikkust nn "mustad augud" automaatse tuvastamise abil, kasutades "Path MTU Discovery" tehnoloogiat
OptWINS=Optimeeri WINS nimepäringu aega andmeside kiirendamiseks
OptNetWork=Optimeeri võrguseadeid kommunikatsiooni kiirendamiseks
CloseAnimate=Keela Windows'ile parema välimuse andmiseks lisatud nn "üleminekuefektid"
PagingExecutive=Keela mälu sisndfailid (pagination) ja vähenda ketta I/O jõuluse parandamiseks. (Seda võib ignoreerida, kui füüsilist mälu on <1 Gb)
StaticIP=Määra kohalikus võrgus staatiline (muutumatu) IP, et käivitumist kiirendada
PorcessorTime=Optimeeri protsessori jõudlust erinevate rakenduste, näiteks mängud jms, kasutamisel. (Ignoreeri serveri korral)
DisableIDECheck=Keela IDE kanali(te) kontroll käivitumise ajal
ForeAppSpeed=Suurenda põhiprogrammide vastamise kiirust
AeroPeek=Kiirenda piilumisakende (Aero Peek) näitamist
OptEthernet=Optimeeri Ethernet kaardi jõudlust

[Type]
Services=Windows'i teenused
Activex=Vigased ActiveX/ COM komponendid
FireWall=Vigased Windows'i tulemüüri seaded
RootAll=Vigased rajad
SoftwareSection=Tarkvara rajad
ApplicationPaths=Rakenduste rajad
FileTypes=Failitüübid
HelpFiles=Abifailid
Fonts=Kirjatüübid
SharedDLL=Jagatud DLL-failid
MRULists=Kasutaja MRU nimistud
UninstallSection=Eemaldamised
StartMenu=Stardimenüü
StartupProgram=Stardiprogrammid
SoundandAppEvents=Helid ja efektid
IEUrlHistory=IE URL ajalugu
IFEO=Süsteemifailide muutused
EmptyKey=Tühjad võtmed
App=Rakenduste seaded

[ErrorMessage]
ServiceNotExists=Sellist teenusprogrammi ei ole olemas.
MimeExName=Leiti vigane MIME faili laiend: %s
EmptyKey=Tühjad võtmed
EmptyHelpdirctory=Tühi abikataloog.
FileNotExist=Faili(kausta) pole olemas.
HFileNotExist=Abifaili(kausta) pole olemas.
EmptyValue=Tühi väli
TypeLib=Raamatukogu tüüpi pole:
NodeEmpty=Tühi sõlm
SharedFilenotexist=Jagatud faili pole olemas.
sharedfilenotbeuse=Jagatud fail pole kasutuses.
noconnection=Olematu faili informatsioon.
Invalidpathtoicon=Vigane ühendustee ikooniga.
ReferstoaninvalidClass=Viide vigasele klassile.
Emptyshellcommand=Tühi shell'i käsk.
Invalidshellcommand=Vigane shell'i käsk (faili ei eksisteeri).
Fontsnotexist=Kirjatüübi faili pole olemas.
Hijacking=%s on hõivatud %s poolt.
MRULists=Kasutaja MRU nimistud
invalidOpenWith=Sellele võtmele/tüübile vastavat faili pole.
ReferActivex=Viide vigasele Activex/COM üksusele.
EmptyCLSID=Tühi CLSID.
ComSourceNotExist=COM algallikat pole olemas.
invalidUnistall=Vigane eemaldamise informatsioon.
notexist=ei eksisteeri.
ObsoleteStartMenuItem=Vananenud stardimenüü üksus.
SoundFilenotexist=Helifaili pole olemas.
FileNotExist1=Faili(kausta) pole olemas, aga draiv "%s" on %s, soovitame seda viga ignoreerida.
OpenWithError=Ava veaga, kui tingimustele vastavat rakendust ei eksisteeri.
OpenWithError1=Ava veaga, määratletud rakendust ei ole olemas. Aga draiv "%s" on %s, soovitame seda viga ignoreerida.
ComSourceNotExist1=COM allikat pole, kuid drive %s on %s, soovitame seda viga ignoreerida.

[Summary]
Services=Vigased Windows teenused
Activex=Vigased ActiveX and COM komponendid
FireWall=Vigased Windows'i tulemüüri seaded
RootAll=Vigased rajad ja failid
SoftwareSection=Tarkvara eemaldamisel jäänud vigased rajad ja failid
ApplicationPaths=Vigased rakenduste registreerimise rajad ja failid
FileTypes=Vigased faililaiendite andmed
HelpFiles=Vigased registreeritud abifailid
Fonts=Vigased kirjatüübid
SharedDLL=Kadunud jagatud dünaamiliste linkide raamatukogud
MRULists=Kasutaja failide, videode, dokumentide jne kasutuse ajalugu.
UninstallSection=Kasutu või vigane väljainstallimise info
StartMenu=Vananenud stardimenüü üksused
StartupProgram=Vananenud stardimenüü programm(id)
SoundandAppEvents=Vanad või vigased helide ja lisade seaded
IEUrlHistory=IE internetikülastuste ajalugu
IFEO=Pahavara, nuhkvara ja viiruste tehtud sissekanded
EmptyKey=Andmed, milles puudub info
App=Vigased rakenduste seaded

[AutoClean]
ErrorsFixed=viga/vead parandati.
Title=Õnnitleme!
ErrorsFound=viga(u) leiti.

[Skin]
SkinDefault=Vaikimisi
SkinBlue=Sinine
SkinGreen=Roheline
SkinCustom=Vali värv
SkinColor=Vali sobiv toon
